org/blog/20171010-orgmode-practice.org
#+Title: orgmode-practice

* preface
今年最长假期结束后的第一个工作日。
明明很多事情，只要一步到位后，剩下的就慢慢更改就行，但是一直没有做的足够一步到位。临门一脚需要足够的下狠心。
比如当前存在的两个事情一直没有解决，今天专注于解决了这两个问题。虽然还不够完善，但是基本达到了正常运转。

* orgmode
近一个月一直坚持用orgmode做个人管理和写博客；总是存在一些小的瑕疵不能让个人达到初步的满意程度。
1. mobileorg一直无法连通webdav
2. 通过orgmode强大的html-publish功能撰写博客，并上传至github中。
拿出一个工作日来做这事也是拼了；不然心里总是有100个不放心。

* mobileorg
结合emacs+orgmode+mobileorg可以做十分完整的个人管理（时间管理）系统。
其中mobileorg支持通过webdav方式将你在PC端写的orgmode文件pull至手机中，并且定期更新。在此不得不推荐国内唯一一家支持webdav、被称之为中国的dropbox的“坚果云”。
具体通过mobileorg链接坚果云、以及配合emacs pull/push org file的事情，日后单独开一个topic进行讲述；今天已经做到联通了。

* github+orgmode
这一点纠结我的是生成blog post总是默认加载一些css文件，而自定义的css文件无法加载。后来找到原因需要关闭默认style展示。再次感谢[[https://dirtysalt.github.io/][yan.zhang]] 给予的orgmode的指导。
