blog/20171010-orgmode-practice.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-19 Mon 18:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>orgmode-practice</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shuchaoma" />
<link rel="stylesheet" type="text/css" href="https://www.shuchaoma.com/css/stylesheet.css">
<link rel="shortcut icon" href="/css/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">orgmode-practice</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9eb505b">1. preface</a></li>
<li><a href="#orgb9770d4">2. orgmode</a></li>
<li><a href="#orge9e6645">3. mobileorg</a></li>
<li><a href="#org570e45b">4. github+orgmode</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9eb505b" class="outline-2">
<h2 id="org9eb505b"><span class="section-number-2">1</span> preface</h2>
<div class="outline-text-2" id="text-1">
<p>
今年最长假期结束后的第一个工作日。
明明很多事情，只要一步到位后，剩下的就慢慢更改就行，但是一直没有做的足够一步到位。临门一脚需要足够的下狠心。
比如当前存在的两个事情一直没有解决，今天专注于解决了这两个问题。虽然还不够完善，但是基本达到了正常运转。
</p>
</div>
</div>

<div id="outline-container-orgb9770d4" class="outline-2">
<h2 id="orgb9770d4"><span class="section-number-2">2</span> orgmode</h2>
<div class="outline-text-2" id="text-2">
<p>
近一个月一直坚持用orgmode做个人管理和写博客；总是存在一些小的瑕疵不能让个人达到初步的满意程度。
</p>
<ol class="org-ol">
<li>mobileorg一直无法连通webdav</li>
<li>通过orgmode强大的html-publish功能撰写博客，并上传至github中。</li>
</ol>
<p>
拿出一个工作日来做这事也是拼了；不然心里总是有100个不放心。
</p>
</div>
</div>

<div id="outline-container-orge9e6645" class="outline-2">
<h2 id="orge9e6645"><span class="section-number-2">3</span> mobileorg</h2>
<div class="outline-text-2" id="text-3">
<p>
结合emacs+orgmode+mobileorg可以做十分完整的个人管理（时间管理）系统。
其中mobileorg支持通过webdav方式将你在PC端写的orgmode文件pull至手机中，并且定期更新。在此不得不推荐国内唯一一家支持webdav、被称之为中国的dropbox的“坚果云”。
具体通过mobileorg链接坚果云、以及配合emacs pull/push org file的事情，日后单独开一个topic进行讲述；今天已经做到联通了。
</p>
</div>
</div>

<div id="outline-container-org570e45b" class="outline-2">
<h2 id="org570e45b"><span class="section-number-2">4</span> github+orgmode</h2>
<div class="outline-text-2" id="text-4">
<p>
这一点纠结我的是生成blog post总是默认加载一些css文件，而自定义的css文件无法加载。后来找到原因需要关闭默认style展示。再次感谢<a href="https://dirtysalt.github.io/">yan.zhang</a> 给予的orgmode的指导。
</p>
</div>
</div>
</div>
</body>
</html>
